#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/fredcorp-learn-tf-cloud/gh-actions-demo/runs/run-FL9csuEuBhFvHJKD

Waiting for the plan to start...

Terraform v1.3.6
on linux_amd64
Initializing plugins and modules...
random_pet.sg: Refreshing state... [id=in-pegasus]
data.aws_ami.ubuntu: Reading...
aws_security_group.web-sg: Refreshing state... [id=sg-0e7416e0bcb295c04]
data.aws_ami.ubuntu: Read complete after 1s [id=ami-01fb8d7fa63b868ae]
aws_instance.web: Refreshing state... [id=i-03f1e3ca2ec56360d]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.web must be replaced
-/+ resource "aws_instance" "web" {
      ~ arn                          = "arn:aws:ec2:us-west-2:820906579125:instance/i-03f1e3ca2ec56360d" -> (known after apply)
      ~ associate_public_ip_address  = true -> (known after apply)
      ~ availability_zone            = "us-west-2c" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 1 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-03f1e3ca2ec56360d" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-0f737599f114190a9" -> (known after apply)
      ~ private_dns                  = "ip-172-31-15-74.us-west-2.compute.internal" -> (known after apply)
      ~ private_ip                   = "172.31.15.74" -> (known after apply)
      ~ public_dns                   = "ec2-54-184-169-67.us-west-2.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                    = "54.184.169.67" -> (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [
          - "in-pegasus-sg",
        ] -> (known after apply)
      ~ subnet_id                    = "subnet-05226d89c9d347896" -> (known after apply)
      - tags                         = {} -> null
      ~ tenancy                      = "default" -> (known after apply)
      ~ user_data                    = "a74c1902c3a74568c11d2b2f7ef4f3aebd88200b" -> "16c8d1984fbd4b31792969c4e9550a62c72224f6" # forces replacement
        # (5 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-05ec63d4e192432bf" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ web-address = "ec2-54-184-169-67.us-west-2.compute.amazonaws.com:8080" -> (known after apply)

------------------------------------------------------------------------

Cost Estimation:

Resources: 1 of 1 estimated
           $8.6304/mo -$0.7999999999999992

```

</details>

*Pushed by: @fredcollman, Action: `pull_request`*